/* 
  Localizable.strings
  CoreSDKTestApp

  Created by Vladimír Nevyhoštěný on 10.11.15.
  Copyright © 2015 Applifting. All rights reserved.
*/

"err-other"                                  = "Obecná chyba.";
"err-empty-data"                             = "Prázdná data.";
"err-empty-password"                         = "Prázdné heslo.";
"err-decryption-failed"                      = "Dešifrování dat selhalo.";
"err-encryption-failed"                      = "Šifrování dat selhalo.";
"err-parsing-data"                           = "Chyba parsování dat.";
"err-no-panination-set"                      = "Není nastaveno stránkování.";
"err-empty-clientid"                         = "Prázdný identifikátor klienta.";
"err-wrong-oauth2-url"                       = "Chybné URL pro OAuth2 autentikaci.";
"err-registration-failed"                    = "Registrace uživatele selhala.";
"err-login-failed"                           = "Odemknutí uživatele selhalo.";
"err-password-change-failed"                 = "User password change failed.";
"err-user-registration-failed"               = "Odregistrování uživatele selhalo.";
"err-touchid-not-available"                  = "Touch ID není dostupné, nebo není definováno.";
"err-empty-json"                             = "Prázdné tělo JSON response.";
"err-otp-unlock-failed"                      = "Odemknutí uživatele s OTP selhalo.";
"err-operation-cancelled"                    = "Operace byla zrušena.";
"err-file-download-failed"                   = "Stažení souboru selhalo.";
"err-attachment-upload-failed"               = "Odeslání přílohy selhalo.";
"err-network-not-available"                  = "Síť není dostupná.";
"err-network-error"                          = "Chyba sítě. Opakujte prosím později.";
"err-protected-data-not-available"           = "Chráněná data nejsou momentálně dostupná.";
"err-server-unavailable"                     = "Vyskytla se neoĊekávaná chyba. Opakujte akci, prosím, později.";
"err-no-access-token"                        = "Chybí přístupový kód.";
"err-no-refresh-token"                       = "Chybí kód pro obnovení.";
"err-wrong-locker-data"                      = "Chybná data lockeru.";
"err-user-not-registered"                    = "Uživatel není registrován.";
"err-no-auth-token"                          = "AutentizaĊní token nenalezen.";
"err-login-canceled"                         = "Přihlašování bylo zrušeno.";
"err-wrong-lock-type"                        = "Nedovolený typ zámku.";
"err-refresh-token-failure"                  = "Obnovení identity selhalo.";
"err-session-timeout"                        = "Vypršel Ċasový limit pro přihlášení.";

"err-wrong-locker-data"                      = "Chybná data lockeru.";
"err-user-not-registered"                    = "Uživatel není registrován.";
"err-unsignable-entity"                      = "Data nelze podepsat.";
"err-signing-failed"                         = "Podpis dat selhal.";
"err-invalid-OTP"                            = "Chybné jednorázové heslo.";
"err-invalid-authorization-type"             = "Chybný typ autorizace.";
"err-unlock-after-migration-failed"          = "Odemknutí uživatele po migraci selhalo.";


"auth-method-pin"                            = "PIN kód";
"auth-method-fingerprint"                    = "otisk prstu";
"auth-method-gesture"                        = "gesto";
"auth-method-none"                           = "bez zabezpeĊení";

"lock-status-unregistered"                   = "neregistrován";
"lock-status-locked"                         = "zamknutý";
"lock-status-unlocked"                       = "odemknutý";

